In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("../data/예제/University_date.csv", encoding="CP949")

In [3]:
df

      대학이름         창립일
0    서울대학교  1946-10-15
1    KAIST  1971-02-16
2    UNIST  2007-09-03
3  포항공과대학교  1986-12-03
4    고려대학교  1905-05-05
5     GIST  1993-11-17
6    건국대학교  1946-05-15
7    울산대학교  1969-12-24
8    부산대학교  1946-05-15

In [4]:
df["창립일"]

0    1946-10-15
1    1971-02-16
2    2007-09-03
3    1986-12-03
4    1905-05-05
5    1993-11-17
6    1946-05-15
7    1969-12-24
8    1946-05-15
Name: 창립일, dtype: object

In [5]:
pd.to_datetime(df["창립일"])

0   1946-10-15
1   1971-02-16
2   2007-09-03
3   1986-12-03
4   1905-05-05
5   1993-11-17
6   1946-05-15
7   1969-12-24
8   1946-05-15
Name: 창립일, dtype: datetime64[ns]

In [6]:
pd.to_datetime(df["창립일"], format="%Y-%m-%d")

0   1946-10-15
1   1971-02-16
2   2007-09-03
3   1986-12-03
4   1905-05-05
5   1993-11-17
6   1946-05-15
7   1969-12-24
8   1946-05-15
Name: 창립일, dtype: datetime64[ns]

In [7]:
df["창립일"] = pd.to_datetime(df["창립일"])

In [8]:
df

      대학이름        창립일
0    서울대학교 1946-10-15
1    KAIST 1971-02-16
2    UNIST 2007-09-03
3  포항공과대학교 1986-12-03
4    고려대학교 1905-05-05
5     GIST 1993-11-17
6    건국대학교 1946-05-15
7    울산대학교 1969-12-24
8    부산대학교 1946-05-15

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   대학이름    9 non-null      object
 1   창립일     9 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(1)
memory usage: 276.0+ bytes

In [10]:
pd.date_range("2000-01-01", "2000-01-10")

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07', '2000-01-08',
               '2000-01-09', '2000-01-10'],
              dtype='datetime64[ns]', freq='D')

In [21]:
pd.date_range("2000-01-01", periods=3, freq="ME")

DatetimeIndex(['2000-01-31', '2000-02-29', '2000-03-31'], dtype='datetime64[ns]', freq='ME')

In [22]:
df = pd.read_csv("../data/예제/University_date.csv", encoding="CP949")

In [23]:
df

      대학이름         창립일
0    서울대학교  1946-10-15
1    KAIST  1971-02-16
2    UNIST  2007-09-03
3  포항공과대학교  1986-12-03
4    고려대학교  1905-05-05
5     GIST  1993-11-17
6    건국대학교  1946-05-15
7    울산대학교  1969-12-24
8    부산대학교  1946-05-15

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   대학이름    9 non-null      object
 1   창립일     9 non-null      object
dtypes: object(2)
memory usage: 276.0+ bytes

In [30]:
df["창립일"] = pd.to_datetime(df["창립일"])

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   대학이름    9 non-null      object
 1   창립일     9 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(1)
memory usage: 276.0+ bytes

In [36]:
df["창립일"].dt.month_name()

0      October
1     February
2    September
3     December
4          May
5     November
6          May
7     December
8          May
Name: 창립일, dtype: object

In [37]:
sr = pd.Series(pd.date_range("2022-06-01 16:30:05", periods=5, freq="s"))
sr

0   2022-06-01 16:30:05
1   2022-06-01 16:30:06
2   2022-06-01 16:30:07
3   2022-06-01 16:30:08
4   2022-06-01 16:30:09
dtype: datetime64[ns]

In [38]:
sr.info()

<class 'pandas.core.series.Series'>
RangeIndex: 5 entries, 0 to 4
Series name: None
Non-Null Count  Dtype
--------------  -----
5 non-null      datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 172.0 bytes

In [39]:
sr.dt.time

0    16:30:05
1    16:30:06
2    16:30:07
3    16:30:08
4    16:30:09
dtype: object

In [40]:
sr.dt.hour

0    16
1    16
2    16
3    16
4    16
dtype: int32

In [41]:
sr.dt.minute

0    30
1    30
2    30
3    30
4    30
dtype: int32

In [42]:
sr.dt.second

0    5
1    6
2    7
3    8
4    9
dtype: int32